namespace Puzzle
{
    public enum Atom
    {
        //I период
        H = 1,//  водород
        He, //  гелий

        //II период
        Li, //  литий
        Be, //  бериллий
        B, //   бор
        C, //  углерод
        N, //  азот
        O, //  кислород
        F, //  фтор
        Ne, // неон

        //III период
        Na, // натрий
        Mg, // магний
        Al, //  алюминий
        Si, // кремний
        P, //  фосфор
        S, //  сера
        Cl, //  хлор
        Ar, //  аргон

        //IV период
        K, //  калий
        Ca, //  кальций
        Sc, //  скандий
        Ti, //  титан
        V, //  ванадий
        Cr, //  хром
        Mn, //  марганец
        Fe, //  железо
        Co, //  кобальт
        Ni, //  никель
        Cu, //  медь
        Zn, //  цинк
        Ga, //  галлий
        Ge, //  германий
        As, //  мышьяк
        Se, //  селен
        Br, //  бром
        Kr, //  криптон

        //V период
        //Rb  рубидий		1s 22s 22p 63s 23p64s 23d104p65s1
        //38	Sr  стронций	1s 22s 22p 63s 23p64s 23d104p65s2
        //39	Y   иттрий		1s 22s 22p 63s 23p64s 23d104p65s24d1
        //40	Zr  цирконий	1s 22s 22p 63s 23p64s 23d104p65s24d2
        //41	Nb  ниобий		1s 22s 22p 63s 23p64s 23d104p65s14d4
        //42	Mo  молибден	1s 22s 22p 63s 23p64s 23d104p65s14d5
        //43	Tc  технеций	1s 22s 22p 63s 23p64s 23d104p65s24d5
        //44	Ru  рутений		1s 22s 22p 63s 23p64s 23d104p65s14d7
        //45	Rh  родий		1s 22s 22p 63s 23p64s 23d104p65s14d8
        //46	Pd  палладий	1s 22s 22p 63s 23p64s 23d104p65s04d10
        //47	Ag  серебро		1s 22s 22p 63s 23p64s 23d104p65s14d10
        //48	Cd  кадмий		1s 22s 22p 63s 23p64s 23d104p65s24d10
        //49	In  индий		1s 22s 22p 63s 23p64s 23d104p65s24d105p1
        //50	Sn  олово		1s 22s 22p 63s 23p64s 23d104p65s24d105p2
        //51	Sb  сурьма		1s 22s 22p 63s 23p64s 23d104p65s224d105p3
        //52	Te  теллур		1s 22s 22p 63s 23p64s 23d104p65s24d105p4
        //53	I   йод		1s 22s 22p 63s 23p64s 23d104p65s24d105p5
        //54	Xe  ксенон		1s 22s 22p 63s 23p64s 23d104p65s24d105p6

        //VI период
        //55	Cs  цезий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s1
        //56	Ba  барий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s2
        //57	La  лантан		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s25d1
        //58	Ce  церий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f2
        //59	Pr  празеодим	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f3
        //60	Nd  неодим		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f4
        //61	Pm  прометий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f5
        //62	Sm  самарий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f6
        //63	Eu  европий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f7
        //64	Gd  гадолиний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f75d1
        //65	Tb  тербий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f9
        //66	Dy  диспрозий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f10
        //67	Ho  гольмий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f11
        //68	Er  эрбий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f12
        //68	Tm  тулий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f13
        //70	Yb  иттербий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f14
        //71	Lu  лютеций		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d1
        //72	Hf  гафний		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d2
        //73	Ta  тантал		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d3
        //74	W   вольфрам	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d4
        //75	Re  рений		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d5
        //76	Os  осмий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d6
        //77	Ir  иридий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d7
        //78	Pt  платина		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s14f145d9
        //79	Au  золото		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s14f145d10
        //80	Hg  ртуть		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d10
        //81	Tl  таллий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p1
        //82	Pb  свинец		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p2
        //83	Bi  висмут		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p3
        //84	Po  полоний		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p4
        //85	At  астат		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p5
        //86	Rn  радон		1s 22s 22p 63s 23p64s 23d104p65s14d105p66s24f145d106p6

        //VII период
        //87	Fr  франций		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s1
        //88	Ra  радий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s2
        //89	Ac  актиний		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s26d1
        //90	Th  торий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s26d25f0
        //91	Pa  протактиний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f26d1
        //92	U   уран		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f36d1
        //93	Np  нептуний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f46d1
        //94	Pu  плутоний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f56d1
        //95	Am  америций	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f7
        //96	Cm  кюрий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f76d1
        //97	Bk  берклий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f86d1
        //98	Cf  калифорний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f10
        //99	Es  эйнштейний	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f11
        //100	Fm  фермий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f12
        //101	Md  менделеевий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f13
        //102	No  нобелий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f14
        //103	Lr  лоуренсий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d1
        //104	Rf  резерфордий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d2
        //105	Db  дубний		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d3
        //106	Sg  сиборгий	1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d4
        //107	Bh  борий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d5
        //108	Hs  хассий		1s 22s 22p 63s 23p64s 23d104p65s24d105p66s24f145d106p67s25f146d6
        //109	Mt
    }
}
